# https://www.acmicpc.net/problem/2903

# 1. 입력값 받기
import sys

N = int(sys.stdin.readline())

# 2. 초기 상태에서 점은 1, 변은 0으로 위치를 리스트에 저장
map = [1, 0, '1', 0, '1', 0, '1', 0]

print('1', map)

# 3. 조건에 맞게 점을 추가하면 변은 [1]에서 [0, 1, 0]으로, 중앙점은 리스트 길이 중간에 [0, 1]으로 추가
for i in range(len(map)):
  if i == (len(map) // 2) - 1:
    map.insert(i, 0)
    map.insert(i+1, 1)
    print('mid', map)
  elif map[i] == 0:
    map.insert(i, 0)
    map.insert(i+1, 1)
    print('other', map)
  
print(map)
print(map.count(1))

# 1     [1, 0, '1', 0, '1', 0, '1', 0]
# other [1, 0, 1, 0, '1', 0, '1', 0, '1', 0]
# other [1, 0, 1, 0, 1, 0, '1', 0, '1', 0, '1', 0]
# mid   [1, 0, 1, 0, 1, 1, 0, 0, '1', 0, '1', 0, '1', 0]
# mid   [1, 0, 1, 0, 1, 1, 1, 0, 0, 0, '1', 0, '1', 0, '1', 0]
# mid   [1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, '1', 0, '1', 0, '1', 0]

1     [1, 0, '1', 0, '1', 0, '1', 0]
other [1, 0, 1, 0, '1', 0, '1', 0, '1', 0]
other [1, 0, 1, 0, 1, 0, '1', 0, '1', 0, '1', 0]
mid   [1, 0, 1, 0, 1, 0, 1, 0, '1', 0, '1', 0, '1', 0]
mid   [1, 0, 1, 0, 1, 0, 0, 1, 1, 0, '1', 0, '1', 0, '1', 0]
mid   [1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, '1', 0, '1', 0, '1', 0]